Repository: AngelFebles/Sustainable-Wage-Tool-APIs
Catalog: doc/locale/*/LC_MESSAGES/foodPlans.po
Languages: es

source: foodPlans module
es: Módulo de planes de alimentación (foodPlans)

source: This function scrapes the USDA website for the most recent food plans and returns the weekly and monthly cost of each plan
es: Esta función rastrea el sitio web del USDA en busca de los planes de alimentación más recientes y devuelve el costo semanal y mensual de cada plan.

source: These food plans are at a federal level, so it doesn't change for different counties.
es: Estos planes alimentarios son a nivel federal, por lo que no cambian para los diferentes condados.

source: The function returns @fused_df, a polars dataframe with the following columns:
es: La función devuelve @fused_df, un marco de datos polares con las siguientes columnas:

source: Cohorts Age Age Cohort Thrifty Monthly Low Monthly M Moderate Monthly Liberal Monthly
es: Cohortes Edad Edad Cohorte Plan Ahorro Mensual Bajo Mensual Moderado Mensual Liberal Mensual

source: Representing the monthly costs for different food plans divided by age group and cohort
es: Representación de los costos mensuales de diferentes planes de alimentación divididos por grupo de edad y cohorte

source: Fuse two DataFrames from the thrifty and low-to-liberal food plans into one.
es: Fusionar dos DataFrames de los planes alimentarios ahorrativos y de bajos a liberales en uno.

source: Parameters
es: Parámetros

source: A DataFrame with columns 'Age', 'Weekly cost', and 'Monthly cost' for the thrifty plan.
es: Un DataFrame con las columnas 'Age', 'Weekly cost', y 'Monthly cost' para el plan de bajo consumo.

source: A DataFrame with columns 'Age', 'Weekly cost low', 'Weekly cost moderate', 'Weekly cost liberal', 'Monthly cost low', 'Monthly cost moderate', and 'Monthly cost liberal' for the low-to-liberal plan.
es: Un DataFrame con las columnas 'Age', 'Weekly cost low', 'Weekly cost moderate', 'Weekly cost liberal', 'Monthly cost low', 'Monthly cost moderate', y 'Monthly cost liberal' para el plan low-to-liberal.

source: Returns
es: La función devuelve:

source: A DataFrame with columns 'Cohorts', 'Age', 'Age Cohort', 'Thrifty Monthly', 'Low Monthly', 'Moderate Monthly', and 'Liberal Monthly'.
es: Un DataFrame con las columnas 'Cohorts', 'Age', 'Age Cohort', 'Thrifty Monthly', 'Low Monthly', 'Moderate Monthly', y 'Liberal Monthly'.

source: Return type
es: Tipo de retorno

source: Calculate the mean of each food plan for each age group.
es: Calcular el promedio de cada plan alimentario para cada grupo de edad.

source: A DataFrame with columns 'Age', 'Age Cohort', 'Thrifty Monthly', 'Low Monthly', 'Moderate Monthly', and 'Liberal Monthly' for the fused food plans.
es: Un DataFrame con las columnas 'Age', 'Age Cohort', 'Thrifty Monthly', 'Low Monthly', 'Moderate Monthly', y 'Liberal Monthly' para los planes alimentarios fusionados.

source: A DataFrame with columns 'Age Cohort', 'Thrifty', 'Low', 'Moderate', and 'Liberal' with the mean of each food plan for each age group.
es: Un DataFrame con las columnas 'Age Cohort', 'Thrifty', 'Low', 'Moderate', y 'Liberal' con el promedio de cada plan alimentario para cada grupo de edad.

source: This function takes a link to the most recent low-liberal plan and returns a polars DataFrame with the following columns:
es: Esta función toma un enlace al plan más reciente de bajo a liberal y devuelve un DataFrame de polars con las siguientes columnas:

source: Columns can be referenced as dictionary keys, so for example, to print the weekly low cost of the moderate plan you do:
es: Las columnas se pueden referenciar como claves de diccionario, así que, por ejemplo, para imprimir el costo semanal bajo del plan moderado haces:

source: And you can also get the nth value of a column by using its index:
es: Y también puedes obtener el enésimo valor de una columna usando su índice:

source: This function takes a link to the most recent thrifty plan and returns a polars DataFrame with the following columns:
es: Esta función toma un enlace al plan más reciente de bajo consumo y devuelve un DataFrame de polars con las siguientes columnas:

source: Columns can be referenced as dictionary keys, so for example, to print the weekly cost of the thrifty plan you do:
es: Las columnas se pueden referenciar como claves de diccionario, así que, por ejemplo, para imprimir el costo semanal del plan de bajo consumo haces:

source: Split a string of numbers with dollar signs into a list of floats.
es: Dividir una cadena de números con signos de dólar en una lista de flotantes.

source: A string of numbers with dollar signs, separated by newlines.
es: Una cadena de números con signos de dólar, separados por saltos de línea.

source: A list of floats.
es: Una lista de flotantes.

source: Examples
es: Ejemplos

source: Splits a string of age group labels into a list of individual age ranges.
es: Divide una cadena de etiquetas de grupos de edad en una lista de rangos de edad individuales.

source: A string containing age group labels separated by newlines, with an "Individual" label at the start.
es: Una cadena que contiene etiquetas de grupos de edad separadas por saltos de línea, con una etiqueta "Individual" al principio.

source: A list containing age ranges for child, male, and female groups, excluding headers.
es: Una lista que contiene rangos de edad para grupos de niños, hombres y mujeres, excluyendo encabezados.
