Repository: AngelFebles/Sustainable-Wage-Tool-APIs
Catalog: doc/locale/*/LC_MESSAGES/jobDataScrapeSEL.po
Languages: es

source: jobDataScrapeSEL module
es: Módulo jobDataScrapeSEL (jobDataScrapeSEL)

source: BLS is very strict with bot activity and automatic data scraping. It prevents using tools like raw Beautiful Soup to download files.
es: BLS es muy estricto con la actividad de bots y la extracción automática de datos. Impide el uso de herramientas como Beautiful Soup sin procesar para descargar archivos.

source: To go around this, we are going to open an instance of Chrome using Selenium and simulate user activity in the page to download a file.
es: Para solucionar esto, vamos a abrir una instancia de Chrome utilizando Selenium y simular actividad de usuario en la página para descargar un archivo.

source: Reads a file downloaded from the BLS website and processes it into a Polars DataFrame with 17 columns.
es: Lee un archivo descargado del sitio web de BLS y lo procesa en un DataFrame de Polars con 17 columnas.

source: Parameters
es: Parámetros

source: The path to the file to read.
es: La ruta del archivo que se debe leer.

source: Returns
es: Devuelve

source: The processed DataFrame with 17 columns.
es: El DataFrame procesado con 17 columnas.

source: Return type
es: Tipo de return

source: Notes
es: Notas

source: The function first reads the file into a DataFrame, then filters it to only include data from the specific County. It then reshapes the data from a single column of 17 values per job to a DataFrame with 17 columns. Finally, it creates a column of job IDs and assigns them to the DataFrame.
es: La función primero lee el archivo en un DataFrame, luego lo filtra para incluir solo datos del condado específico. Luego, reorganiza los datos de una sola columna de 17 valores por trabajo a un DataFrame con 17 columnas. Finalmente, crea una columna de IDs de trabajo y los asigna al DataFrame.

source: All the commented out print statements are for debugging purposes.
es: Todas las declaraciones de impresión comentadas son para propósitos de depuración.

source: Given a county name, this function returns the corresponding 'area_code' value from the 'oe.area' file. This value is used to query the BLS API for data specific to the county.
es: Dado un nombre de condado, esta función devuelve el valor correspondiente de 'area_code' del archivo 'oe.area'. Este valor se utiliza para consultar la API de BLS para datos específicos del condado.

source: The name of the county for which the 'area_code' needs to be retrieved.
es: El nombre del condado para el cual se necesita obtener el 'area_code'.

source: The 'area_code' value for the given county.
es: El valor de 'area_code' para el condado dado.

source: Scrapes the Bureau of Labor Statistics (BLS) website to extract education and training requirements by occupation, and returns the data as a Polars DataFrame.
es: Rastrea el sitio web del Bureau of Labor Statistics (BLS) para extraer los requisitos de educación y capacitación por ocupación, y devuelve los datos como un DataFrame de Polars.

source: The function uses Selenium to navigate to the BLS webpage and retrieve the HTML content. BeautifulSoup is then used to parse the page and find the relevant table containing education requirements. The table data is extracted, cleaned, and converted into a Polars DataFrame, with the last row and column removed as they contain non-essential information.
es: La función utiliza Selenium para navegar a la página web del BLS y recuperar el contenido HTML. Luego, BeautifulSoup se utiliza para analizar la página y encontrar la tabla relevante que contiene los requisitos de educación. Los datos de la tabla se extraen, limpian y convierten en un DataFrame de Polars, eliminando la última fila y columna, ya que contienen información no esencial.

source: A DataFrame containing education and training requirements by occupation, with each column representing a different attribute.
es: Un DataFrame que contiene los requisitos de educación y capacitación por ocupación, donde cada columna representa un atributo diferente.

source: Given a DataFrame with job data, this function filters it to only include data from the specific County.
es: Dado un DataFrame con datos de trabajos, esta función lo filtra para incluir solo datos del condado específico.

source: The DataFrame to filter.
es: El DataFrame a filtrar.

source: The 'area_code' value for the county of interest.
es: El valor de 'area_code' para el condado de interés.

source: The filtered DataFrame containing only data from Racine County.
es: El DataFrame filtrado que contiene solo datos del condado de Racine.
