Repository: AngelFebles/Sustainable-Wage-Tool-APIs
Catalog: doc/locale/*/LC_MESSAGES/monthlyBudget.po
Languages: es

source: monthlyBudget module
es: Módulo monthlyBudget (monthlyBudget)

source: This function takes a list length and returns a list of formulas for calculating the food costs column in the monthly budget dataframe.
es: Esta función recibe una longitud de lista y devuelve una lista de fórmulas para calcular la columna de costos de alimentos en el DataFrame del presupuesto mensual.

source: The formulas are based on the food means table and the housing selection, food selection, and family type columns in the monthly budget dataframe.
es: Las fórmulas se basan en la tabla de promedios de alimentos y en las columnas de selección de vivienda, selección de alimentos y tipo de familia en el DataFrame del presupuesto mensual.

source: Parameters
es: Parámetros

source: The length of the list to be returned.
es: La longitud de la lista que se devolverá.

source: Returns
es: Devuelve

source: A list of formulas for calculating the food costs column in the monthly budget dataframe.
es: Una lista de fórmulas para calcular la columna de costos de alimentos en el DataFrame del presupuesto mensual.

source: Return type
es: Tipo de return

source: This function takes the Self Sufficiency Standard DataFrame and the Housing Costs DataFrame to generate the monthly budget for different family types and housing plans.
es: Esta función utiliza el DataFrame de Estándar de Autosuficiencia y el DataFrame de Costos de Vivienda para generar el presupuesto mensual para diferentes tipos de familia y planes de vivienda.

source: It also takes into account the different food plans and their costs. (From foodPlans.py)
es: También tiene en cuenta los diferentes planes de alimentos y sus costos. (Desde foodPlans.py)

source: The function returns a Polars DataFrame with the monthly budget for each family type and housing plan.
es: La función devuelve un DataFrame de Polars con el presupuesto mensual para cada tipo de familia y plan de vivienda.

source: The monthly budget includes the costs of the housing plan, the food plan, and other costs such as broadband and cell phone, health care costs, transportation costs, and taxes. The function also subtracts the earned income tax credit, the child care tax credit, and the child tax credit from the monthly budget.
es: El presupuesto mensual incluye los costos del plan de vivienda, el plan de alimentos y otros costos como banda ancha y teléfono celular, costos de atención médica, costos de transporte e impuestos. La función también resta el crédito fiscal por ingresos, el crédito fiscal por cuidado infantil y el crédito fiscal por hijos del presupuesto mensual.

source: The Self Sufficiency Standard DataFrame, which contains the monthly costs for each family type and housing plan.
es: El DataFrame de Estándar de Autosuficiencia, que contiene los costos mensuales para cada tipo de familia y plan de vivienda.

source: The Housing Costs DataFrame, which contains the costs of each housing plan.
es: El DataFrame de Costos de Vivienda, que contiene los costos de cada plan de vivienda.

source: A Polars DataFrame with the monthly budget for each family type and housing plan.
es: Un DataFrame de Polars con el presupuesto mensual para cada tipo de familia y plan de vivienda.
